OpenPuya/PY32F0xx_Firmware/Templates/PY32F030xx_Templates/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.0/Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f031x8.h
/*******************  Bit definition for SPI_CR2 register  ********************/
#define SPI_CR2_RXDMAEN_Pos                 (0U)
#define SPI_CR2_RXDMAEN_Msk                 (0x1UL << SPI_CR2_RXDMAEN_Pos)      /*!< 0x00000001 */
#define SPI_CR2_RXDMAEN                     SPI_CR2_RXDMAEN_Msk                 /*!< Rx Buffer DMA Enable */
#define SPI_CR2_TXDMAEN_Pos                 (1U)
#define SPI_CR2_TXDMAEN_Msk                 (0x1UL << SPI_CR2_TXDMAEN_Pos)      /*!< 0x00000002 */
#define SPI_CR2_TXDMAEN                     SPI_CR2_TXDMAEN_Msk                 /*!< Tx Buffer DMA Enable */
#define SPI_CR2_SSOE_Pos                    (2U)
#define SPI_CR2_SSOE_Msk                    (0x1UL << SPI_CR2_SSOE_Pos)         /*!< 0x00000004 */
#define SPI_CR2_SSOE                        SPI_CR2_SSOE_Msk                    /*!< SS Output Enable */
#define SPI_CR2_CLRTXFIFO_Pos               (4U)
#define SPI_CR2_CLRTXFIFO_Msk               (0x1UL << SPI_CR2_CLRTXFIFO_Pos)    /*!< 0x00000010 */
#define SPI_CR2_CLRTXFIFO                   SPI_CR2_CLRTXFIFO_Msk               /*!< Clear TXFIFO */
#define SPI_CR2_ERRIE_Pos                   (5U)
#define SPI_CR2_ERRIE_Msk                   (0x1UL << SPI_CR2_ERRIE_Pos)        /*!< 0x00000020 */
#define SPI_CR2_ERRIE                       SPI_CR2_ERRIE_Msk                   /*!< Error Interrupt Enable */
#define SPI_CR2_RXNEIE_Pos                  (6U)
#define SPI_CR2_RXNEIE_Msk                  (0x1UL << SPI_CR2_RXNEIE_Pos)       /*!< 0x00000040 */
#define SPI_CR2_RXNEIE                      SPI_CR2_RXNEIE_Msk                  /*!< RX buffer Not Empty Interrupt Enable */
#define SPI_CR2_TXEIE_Pos                   (7U)
#define SPI_CR2_TXEIE_Msk                   (0x1UL << SPI_CR2_TXEIE_Pos)        /*!< 0x00000080 */
#define SPI_CR2_TXEIE                       SPI_CR2_TXEIE_Msk                   /*!< Tx buffer Empty Interrupt Enable */

/********************  Bit definition for SPI_SR register  ********************/
#define SPI_SR_RXNE_Pos                     (0U)
#define SPI_SR_RXNE_Msk                     (0x1UL << SPI_SR_RXNE_Pos)          /*!< 0x00000001 */
#define SPI_SR_RXNE                         SPI_SR_RXNE_Msk                     /*!< Receive buffer Not Empty */
#define SPI_SR_TXE_Pos                      (1U)
#define SPI_SR_TXE_Msk                      (0x1UL << SPI_SR_TXE_Pos)           /*!< 0x00000002 */
#define SPI_SR_TXE                          SPI_SR_TXE_Msk                      /*!< Transmit buffer Empty */
#define SPI_SR_CHSIDE_Pos                   (2U)
#define SPI_SR_CHSIDE_Msk                   (0x1UL << SPI_SR_CHSIDE_Pos)        /*!< 0x00000004 */
#define SPI_SR_CHSIDE                       SPI_SR_CHSIDE_Msk                   /*!< Channel control */
#define SPI_SR_UDR_Pos                      (3U)
#define SPI_SR_UDR_Msk                      (0x1UL << SPI_SR_UDR_Pos)           /*!< 0x00000008 */
#define SPI_SR_UDR                          SPI_SR_UDR_Msk                      /*!< UDR flag */
#define SPI_SR_CRCERR_Pos                   (4U)
#define SPI_SR_CRCERR_Msk                   (0x1UL << SPI_SR_CRCERR_Pos)        /*!< 0x00000010 */
#define SPI_SR_CRCERR                       SPI_SR_CRCERR_Msk                   /*!< CRC error flag */
#define SPI_SR_MODF_Pos                     (5U)
#define SPI_SR_MODF_Msk                     (0x1UL << SPI_SR_MODF_Pos)          /*!< 0x00000020 */
#define SPI_SR_MODF                         SPI_SR_MODF_Msk                     /*!< Mode fault */
#define SPI_SR_OVR_Pos                      (6U)
#define SPI_SR_OVR_Msk                      (0x1UL << SPI_SR_OVR_Pos)           /*!< 0x00000040 */
#define SPI_SR_OVR                          SPI_SR_OVR_Msk                      /*!< Overrun flag */
#define SPI_SR_BSY_Pos                      (7U)
#define SPI_SR_BSY_Msk                      (0x1UL << SPI_SR_BSY_Pos)           /*!< 0x00000080 */
#define SPI_SR_BSY                          SPI_SR_BSY_Msk                      /*!< Busy flag */
#define SPI_SR_FRLVL_Pos                    (9U)
#define SPI_SR_FRLVL_Msk                    (0x3UL << SPI_SR_FRLVL_Pos)         /*!< 0x00000600 */
#define SPI_SR_FRLVL                        SPI_SR_FRLVL_Msk                    /*!< FIFO Reception Level */
#define SPI_SR_FRLVL_0                      (0x1UL << SPI_SR_FRLVL_Pos)         /*!< 0x00000200 */
#define SPI_SR_FRLVL_1                      (0x2UL << SPI_SR_FRLVL_Pos)         /*!< 0x00000400 */
#define SPI_SR_FTLVL_Pos                    (11U)
#define SPI_SR_FTLVL_Msk                    (0x3UL << SPI_SR_FTLVL_Pos)         /*!< 0x00001800 */
#define SPI_SR_FTLVL                        SPI_SR_FTLVL_Msk                    /*!< FIFO Transmission Level */
#define SPI_SR_FTLVL_0                      (0x1UL << SPI_SR_FTLVL_Pos)         /*!< 0x00000800 */
#define SPI_SR_FTLVL_1                      (0x2UL << SPI_SR_FTLVL_Pos)         /*!< 0x00001000 */

/********************  Bit definition for SPI_DR register  ********************/
#define SPI_DR_DR_Pos                       (0U)
#define SPI_DR_DR_Msk                       (0xFFFFUL << SPI_DR_DR_Pos)         /*!< 0x0000FFFF */
#define SPI_DR_DR                           SPI_DR_DR_Msk                       /*!< Data Register */

/********************  Bit definition for SPI_CRCPR register  ********************/
#define SPI_CRCPR_CRCPOLY_Pos               (0U)
#define SPI_CRCPR_CRCPOLY_Msk               (0xFFFFUL << SPI_CRCPR_CRCPOLY_Pos) /*!< 0x0000FFFF */
#define SPI_CRCPR_CRCPOLY                   SPI_CRCPR_CRCPOLY_Msk               /*!< CRC polynomial Register */

/********************  Bit definition for SPI_RXCRC register  ********************/
#define SPI_RXCRC_RXCRC_Pos               (0U)
#define SPI_RXCRC_RXCRC_Msk               (0xFFFFUL << SPI_RXCRC_RXCRC_Pos) /*!< 0x0000FFFF */
#define SPI_RXCRC_RXCRC                   SPI_RXCRC_RXCRC_Msk               /*!< RX CRC polynomial Register */

/********************  Bit definition for SPI_TXCRC register  ********************/
#define SPI_TXCRC_TXCRC_Pos               (0U)
#define SPI_TXCRC_TXCRC_Msk               (0xFFFFUL << SPI_TXCRC_TXCRC_Pos) /*!< 0x0000FFFF */
#define SPI_TXCRC_TXCRC                   SPI_TXCRC_TXCRC_Msk               /*!< TX CRC polynomial Register */

/********************  Bit definition for SPI_I2SCFGR register  ********************/
#define SPI_I2SCFGR_CHLEN_Pos               (0U)
#define SPI_I2SCFGR_CHLEN_Msk               (0x1UL << SPI_I2SCFGR_CHLEN_Pos)    /*!< 0x00000001 */
#define SPI_I2SCFGR_CHLEN                   SPI_I2SCFGR_CHLEN_Msk               /*!< Channel length */
#define SPI_I2SCFGR_DATLEN_Pos              (1U)
#define SPI_I2SCFGR_DATLEN_Msk              (0x3UL << SPI_I2SCFGR_DATLEN_Pos)   /*!< 0x00000006 */
#define SPI_I2SCFGR_DATLEN                  SPI_I2SCFGR_DATLEN_Msk              /*!< Data length */
#define SPI_I2SCFGR_DATLEN_0                (0x1UL << SPI_I2SCFGR_DATLEN_Pos)   /*!< 0x00000002 */
#define SPI_I2SCFGR_DATLEN_1                (0x2UL << SPI_I2SCFGR_DATLEN_Pos)   /*!< 0x00000004 */
#define SPI_I2SCFGR_CKPOL_Pos               (3U)
#define SPI_I2SCFGR_CKPOL_Msk               (0x1UL << SPI_I2SCFGR_CKPOL_Pos)    /*!< 0x00000008 */
#define SPI_I2SCFGR_CKPOL                   SPI_I2SCFGR_CKPOL_Msk               /*!< Steady state clock polarity */
#define SPI_I2SCFGR_I2SSTD_Pos              (4U)
#define SPI_I2SCFGR_I2SSTD_Msk              (0x3UL << SPI_I2SCFGR_I2SSTD_Pos)   /*!< 0x00000030 */
#define SPI_I2SCFGR_I2SSTD                  SPI_I2SCFGR_I2SSTD_Msk              /*!< I2S standard selection */
#define SPI_I2SCFGR_I2SSTD_0                (0x1UL << SPI_I2SCFGR_I2SSTD_Pos)   /*!< 0x00000010 */
#define SPI_I2SCFGR_I2SSTD_1                (0x2UL << SPI_I2SCFGR_I2SSTD_Pos)   /*!< 0x00000020 */
#define SPI_I2SCFGR_PCMSYNC_Pos             (7U)
#define SPI_I2SCFGR_PCMSYNC_Msk             (0x1UL << SPI_I2SCFGR_PCMSYNC_Pos)  /*!< 0x00000080 */
#define SPI_I2SCFGR_PCMSYNC                 SPI_I2SCFGR_PCMSYNC_Msk             /*!< PCM frame synchronization */
#define SPI_I2SCFGR_I2SCFG_Pos              (8U)
#define SPI_I2SCFGR_I2SCFG_Msk              (0x3UL << SPI_I2SCFGR_I2SCFG_Pos)   /*!< 0x00000300 */
#define SPI_I2SCFGR_I2SCFG                  SPI_I2SCFGR_I2SCFG_Msk              /*!< I2S configuration mode */
#define SPI_I2SCFGR_I2SCFG_0                (0x1UL << SPI_I2SCFGR_I2SCFG_Pos)   /*!< 0x00000100 */
#define SPI_I2SCFGR_I2SCFG_1                (0x2UL << SPI_I2SCFGR_I2SCFG_Pos)   /*!< 0x00000200 */
#define SPI_I2SCFGR_I2SE_Pos                (10U)
#define SPI_I2SCFGR_I2SE_Msk                (0x1UL << SPI_I2SCFGR_I2SE_Pos)     /*!< 0x00000400 */
#define SPI_I2SCFGR_I2SE                    SPI_I2SCFGR_I2SE_Msk                /*!< I2S enable */
#define SPI_I2SCFGR_I2SMOD_Pos              (11U)
#define SPI_I2SCFGR_I2SMOD_Msk              (0x1UL << SPI_I2SCFGR_I2SMOD_Pos)   /*!< 0x00000800 */
#define SPI_I2SCFGR_I2SMOD                  SPI_I2SCFGR_I2SMOD_Msk              /*!< I2S mode selection */

/********************  Bit definition for SPI_I2S_PR register  ********************/
#define SPI_I2SPR_I2SDIV_Pos               (0U)
#define SPI_I2SPR_I2SDIV_Msk               (0xFFUL << SPI_I2SPR_I2SDIV_Pos)    /*!< 0x000000FF */
#define SPI_I2SPR_I2SDIV                   SPI_I2SPR_I2SDIV_Msk                /*!< I2S linear prescaler */
#define SPI_I2SPR_ODD_Pos                  (8U)
#define SPI_I2SPR_ODD_Msk                  (0x1UL << SPI_I2SPR_ODD_Pos)        /*!< 0x00000100 */
#define SPI_I2SPR_ODD                      SPI_I2SPR_ODD_Msk                   /*!< Odd factor for the prescaler */
#define SPI_I2SPR_MCKOE_Pos                (9U)
#define SPI_I2SPR_MCKOE_Msk                (0x1UL << SPI_I2SPR_MCKOE_Pos)      /*!< 0x00000200 */
#define SPI_I2SPR_MCKOE                    SPI_I2SPR_MCKOE_Msk                 /*!< Master clock output enable */

#define SPI_I2S_SUPPORT       /*!< I2S support */
/******************************************************************************/
/*                                                                            */
/*                       System Configuration (SYSCFG)                        */
/*                                                                            */
/******************************************************************************/
/*****************  Bit definition for SYSCFG_CFGR1 register  ****************/
#define SYSCFG_CFGR1_MEM_MODE_Pos                  (0U)
#define SYSCFG_CFGR1_MEM_MODE_Msk                  (0x3UL << SYSCFG_CFGR1_MEM_MODE_Pos) /*!< 0x00000003 */
#define SYSCFG_CFGR1_MEM_MODE                      SYSCFG_CFGR1_MEM_MODE_Msk            /*!< SYSCFG_Memory Remap Config */
#define SYSCFG_CFGR1_MEM_MODE_0                    (0x1UL << SYSCFG_CFGR1_MEM_MODE_Pos) /*!< 0x00000001 */
#define SYSCFG_CFGR1_MEM_MODE_1                    (0x2UL << SYSCFG_CFGR1_MEM_MODE_Pos) /*!< 0x00000002 */
#define SYSCFG_CFGR1_TIM1_IC1_SRC_Pos              (2U)
#define SYSCFG_CFGR1_TIM1_IC1_SRC_Msk              (0x3UL << SYSCFG_CFGR1_TIM1_IC1_SRC_Pos)
#define SYSCFG_CFGR1_TIM1_IC1_SRC                  SYSCFG_CFGR1_TIM1_IC1_SRC_Msk
#define SYSCFG_CFGR1_TIM1_IC1_SRC_0                (0x1UL << SYSCFG_CFGR1_TIM1_IC1_SRC_Pos)
#define SYSCFG_CFGR1_TIM1_IC1_SRC_1                (0x2UL << SYSCFG_CFGR1_TIM1_IC1_SRC_Pos)
#define SYSCFG_CFGR1_TIM2_IC4_SRC_Pos              (4U)
#define SYSCFG_CFGR1_TIM2_IC4_SRC_Msk              (0x3UL << SYSCFG_CFGR1_TIM2_IC4_SRC_Pos)
#define SYSCFG_CFGR1_TIM2_IC4_SRC                  SYSCFG_CFGR1_TIM2_IC4_SRC_Msk
#define SYSCFG_CFGR1_TIM2_IC4_SRC_0                (0x1UL << SYSCFG_CFGR1_TIM2_IC4_SRC_Pos)
#define SYSCFG_CFGR1_TIM2_IC4_SRC_1                (0x2UL << SYSCFG_CFGR1_TIM2_IC4_SRC_Pos)
#define SYSCFG_CFGR1_ETR_SRC_TIM1_Pos              (8U)
#define SYSCFG_CFGR1_ETR_SRC_TIM1_Msk              (0x3UL << SYSCFG_CFGR1_ETR_SRC_TIM1_Pos)
#define SYSCFG_CFGR1_ETR_SRC_TIM1                  SYSCFG_CFGR1_ETR_SRC_TIM1_Msk
#define SYSCFG_CFGR1_ETR_SRC_TIM1_0                (0x1UL << SYSCFG_CFGR1_ETR_SRC_TIM1_Pos)
#define SYSCFG_CFGR1_ETR_SRC_TIM1_1                (0x2UL << SYSCFG_CFGR1_ETR_SRC_TIM1_Pos)
#define SYSCFG_CFGR1_ETR_SRC_TIM2_Pos              (12U)
#define SYSCFG_CFGR1_ETR_SRC_TIM2_Msk              (0x3UL << SYSCFG_CFGR1_ETR_SRC_TIM2_Pos)
#define SYSCFG_CFGR1_ETR_SRC_TIM2                  SYSCFG_CFGR1_ETR_SRC_TIM2_Msk
#define SYSCFG_CFGR1_ETR_SRC_TIM2_0                (0x1UL << SYSCFG_CFGR1_ETR_SRC_TIM2_Pos)
#define SYSCFG_CFGR1_ETR_SRC_TIM2_1                (0x2UL << SYSCFG_CFGR1_ETR_SRC_TIM2_Pos)
#define SYSCFG_CFGR1_GPIO_AHB_SEL_Pos              (24U)
#define SYSCFG_CFGR1_GPIO_AHB_SEL_Msk              (0x1UL << SYSCFG_CFGR1_GPIO_AHB_SEL_Pos)
#define SYSCFG_CFGR1_GPIO_AHB_SEL                  SYSCFG_CFGR1_GPIO_AHB_SEL_Msk

/******************  Bit definition for SYSCFG_CFGR2 register  ****************/
#define SYSCFG_CFGR2_LOCKUP_LOCK_Pos               (0U)
#define SYSCFG_CFGR2_LOCKUP_LOCK_Msk               (0x1UL << SYSCFG_CFGR2_LOCKUP_LOCK_Pos)   /*!< 0x00000001 */
#define SYSCFG_CFGR2_LOCKUP_LOCK                   SYSCFG_CFGR2_LOCKUP_LOCK_Msk              /*!< Enables and locks the LOCKUP_LOCK (Hardfault) output of CortexM0 with Break Input of TIMER1 */
#define SYSCFG_CFGR2_PVD_LOCK_Pos                  (2U)
#define SYSCFG_CFGR2_PVD_LOCK_Msk                  (0x1UL << SYSCFG_CFGR2_PVD_LOCK_Pos)  /*!< 0x00000004 */
#define SYSCFG_CFGR2_PVD_LOCK                      SYSCFG_CFGR2_PVD_LOCK_Msk             /*!< Enables and locks the PVD connection with Timer1 Break Input and also the PVD_EN and PVDSEL[2:0] bits of the Power Control Interface */
#define SYSCFG_CFGR2_COMP1_BRK_TIM1_Pos            (3U)
#define SYSCFG_CFGR2_COMP1_BRK_TIM1_Msk            (0x1UL << SYSCFG_CFGR2_COMP1_BRK_TIM1_Pos)  /*!< 0x00000008 */
#define SYSCFG_CFGR2_COMP1_BRK_TIM1                SYSCFG_CFGR2_COMP1_BRK_TIM1_Msk             /*!< COMP1_BRK_TIM1 */
#define SYSCFG_CFGR2_COMP2_BRK_TIM1_Pos            (4U)
#define SYSCFG_CFGR2_COMP2_BRK_TIM1_Msk            (0x1UL << SYSCFG_CFGR2_COMP2_BRK_TIM1_Pos)  /*!< 0x00000010 */
#define SYSCFG_CFGR2_COMP2_BRK_TIM1                SYSCFG_CFGR2_COMP2_BRK_TIM1_Msk             /*!< COMP2_BRK_TIM1 */
#define SYSCFG_CFGR2_COMP1_BRK_TIM16_Pos           (5U)
#define SYSCFG_CFGR2_COMP1_BRK_TIM16_Msk           (0x1UL << SYSCFG_CFGR2_COMP1_BRK_TIM16_Pos)  /*!< 0x00000020 */
#define SYSCFG_CFGR2_COMP1_BRK_TIM16               SYSCFG_CFGR2_COMP1_BRK_TIM16_Msk             /*!< COMP1_BRK_TIM16 */
#define SYSCFG_CFGR2_COMP2_BRK_TIM16_Pos           (6U)
#define SYSCFG_CFGR2_COMP2_BRK_TIM16_Msk           (0x1UL << SYSCFG_CFGR2_COMP2_BRK_TIM16_Pos)  /*!< 0x00000040 */
#define SYSCFG_CFGR2_COMP2_BRK_TIM16               SYSCFG_CFGR2_COMP2_BRK_TIM16_Msk             /*!< COMP2_BRK_TIM16 */
#define SYSCFG_CFGR2_COMP1_BRK_TIM17_Pos           (7U)
#define SYSCFG_CFGR2_COMP1_BRK_TIM17_Msk           (0x1UL << SYSCFG_CFGR2_COMP1_BRK_TIM17_Pos)  /*!< 0x00000080 */
#define SYSCFG_CFGR2_COMP1_BRK_TIM17               SYSCFG_CFGR2_COMP1_BRK_TIM17_Msk             /*!< COMP1_BRK_TIM17 */
#define SYSCFG_CFGR2_COMP2_BRK_TIM17_Pos           (8U)
#define SYSCFG_CFGR2_COMP2_BRK_TIM17_Msk           (0x1UL << SYSCFG_CFGR2_COMP2_BRK_TIM17_Pos)  /*!< 0x00000100 */
#define SYSCFG_CFGR2_COMP2_BRK_TIM17               SYSCFG_CFGR2_COMP2_BRK_TIM17_Msk             /*!< COMP2_BRK_TIM17 */
#define SYSCFG_CFGR2_COMP1_OCREF_CLR_TIM1_Pos      (9U)
#define SYSCFG_CFGR2_COMP1_OCREF_CLR_TIM1_Msk      (0x1UL << SYSCFG_CFGR2_COMP1_OCREF_CLR_TIM1_Pos)  /*!< 0x00000200 */
#define SYSCFG_CFGR2_COMP1_OCREF_CLR_TIM1          SYSCFG_CFGR2_COMP1_OCREF_CLR_TIM1_Msk             /*!< COMP1_OCREF_CLR_TIM1 */
#define SYSCFG_CFGR2_COMP1_OCREF_CLR_TIM2_Pos      (10U)
#define SYSCFG_CFGR2_COMP1_OCREF_CLR_TIM2_Msk      (0x1UL << SYSCFG_CFGR2_COMP1_OCREF_CLR_TIM2_Pos)  /*!< 0x00000400 */
#define SYSCFG_CFGR2_COMP1_OCREF_CLR_TIM2          SYSCFG_CFGR2_COMP1_OCREF_CLR_TIM2_Msk             /*!< COMP1_OCREF_CLR_TIM2 */
#define SYSCFG_CFGR2_COMP2_OCREF_CLR_TIM1_Pos      (11U)
#define SYSCFG_CFGR2_COMP2_OCREF_CLR_TIM1_Msk      (0x1UL << SYSCFG_CFGR2_COMP2_OCREF_CLR_TIM1_Pos)  /*!< 0x00000800 */
#define SYSCFG_CFGR2_COMP2_OCREF_CLR_TIM1          SYSCFG_CFGR2_COMP2_OCREF_CLR_TIM1_Msk             /*!< COMP2_OCREF_CLR_TIM1 */
#define SYSCFG_CFGR2_COMP2_OCREF_CLR_TIM2_Pos      (12U)
#define SYSCFG_CFGR2_COMP2_OCREF_CLR_TIM2_Msk      (0x1UL << SYSCFG_CFGR2_COMP2_OCREF_CLR_TIM2_Pos)  /*!< 0x00001000 */
#define SYSCFG_CFGR2_COMP2_OCREF_CLR_TIM2          SYSCFG_CFGR2_COMP2_OCREF_CLR_TIM2_Msk             /*!< COMP2_OCREF_CLR_TIM2 */

/*****************  Bit definition for SYSCFG_CFGR3 register  ****************/
#define SYSCFG_CFGR3_DMA1_MAP_Pos                  (0U)
#define SYSCFG_CFGR3_DMA1_MAP_Msk                  (0x3FUL << SYSCFG_CFGR3_DMA1_MAP_Pos)   /*!< 0x0000003F */
#define SYSCFG_CFGR3_DMA1_MAP                      SYSCFG_CFGR3_DMA1_MAP_Msk
#define SYSCFG_CFGR3_DMA1_MAP_0                    (0x1UL << SYSCFG_CFGR3_DMA1_MAP_Pos)    /*!< 0x00000001 */
#define SYSCFG_CFGR3_DMA1_MAP_1                    (0x2UL << SYSCFG_CFGR3_DMA1_MAP_Pos)    /*!< 0x00000002 */ 
#define SYSCFG_CFGR3_DMA1_MAP_2                    (0x4UL << SYSCFG_CFGR3_DMA1_MAP_Pos)    /*!< 0x00000004 */
#define SYSCFG_CFGR3_DMA1_MAP_3                    (0x8UL << SYSCFG_CFGR3_DMA1_MAP_Pos)    /*!< 0x00000008 */
#define SYSCFG_CFGR3_DMA1_MAP_4                    (0x10UL << SYSCFG_CFGR3_DMA1_MAP_Pos)   /*!< 0x00000010 */
#define SYSCFG_CFGR3_DMA1_MAP_5                    (0x20UL << SYSCFG_CFGR3_DMA1_MAP_Pos)   /*!< 0x00000020 */

#define SYSCFG_CFGR3_DMA2_MAP_Pos                  (8U)
#define SYSCFG_CFGR3_DMA2_MAP_Msk                  (0x3FUL << SYSCFG_CFGR3_DMA2_MAP_Pos)   /*!< 0x00003F00 */
#define SYSCFG_CFGR3_DMA2_MAP                      SYSCFG_CFGR3_DMA2_MAP_Msk
#define SYSCFG_CFGR3_DMA2_MAP_0                    (0x1UL << SYSCFG_CFGR3_DMA2_MAP_Pos)    /*!< 0x00000100 */
#define SYSCFG_CFGR3_DMA2_MAP_1                    (0x2UL << SYSCFG_CFGR3_DMA2_MAP_Pos)    /*!< 0x00000200 */
#define SYSCFG_CFGR3_DMA2_MAP_2                    (0x4UL << SYSCFG_CFGR3_DMA2_MAP_Pos)    /*!< 0x00000400 */
#define SYSCFG_CFGR3_DMA2_MAP_3                    (0x8UL << SYSCFG_CFGR3_DMA2_MAP_Pos)    /*!< 0x00000800 */
#define SYSCFG_CFGR3_DMA2_MAP_4                    (0x10UL << SYSCFG_CFGR3_DMA2_MAP_Pos)   /*!< 0x00001000 */
#define SYSCFG_CFGR3_DMA2_MAP_5                    (0x20UL << SYSCFG_CFGR3_DMA2_MAP_Pos)   /*!< 0x00002000 */

